<?php

namespace Database\Seeders;

use App\Models\Books;
use App\Models\Categories;
use Illuminate\Database\Seeder;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $books = [
            [
                'title_hy' => '«Մուշի տարօրինակ ճամփորդությունը»',
                'title_en' => 'The Strange Journey of Mush',
                'category_id' => Categories::BEN,
                'slug' => 'the-strange-journey-of-mush',
                'text_hy' => 'Սարսափելի վթարից հետո փոքրիկ Մուշի մեջ վախ է մտել. նա վախենում է
                   մթությունից, վախենում է, որ այլևս չի կարողանա քայլել, վախենում է կորցնել հայրիկին և
                   այլևս երբեք չվերադառնալ իր նախկին կյանքին։ Բայց մի բարի օր, ավելի շուտ՝ մի բարի
                   գիշեր, երբ նա, վերմակի տակ ծածկված, փորձում է թաքնվել իր այդ վախերից, մի
                   զարմանալի հյուր է այցելում նրան։ Տղայի սեփական երազի միջից պատահաբար Արտաշխարհ վայր ընկած փոքրիկ տարօրինակ արարածը՝ Փսփսիկը,
                   աղերսում է փրկել իրեն և վերադարձնել իր հայրենի Ներաշխարհ։ Տղան Փսփսիկի օգնությամբ վերագտնում է իր մոռացված ընկերոջը՝ Լուսունիկին,
                   որի ուղեկցությամբ տարօրինակ եռյակը ճամփա է ընկնում դեպի Մուշի երազների հրաշալի երկիր։
                   Ճանապարհին նրանք հանդիպում են զարմանահրաշ արարածների և անցնում բազմաթիվ փորձությունների միջով:',
                'text_en' => '',
                'description_hy' => 'Փոքրիկ Մուշի, Փսփսիկի ու Լուսունիկի հետաքրքիր ճամփորդությունը երազների աշխարհում',
                'description_en' => '',
                'book_size_hy' => '14.5x22.3, կոշտ կազմ',
                'book_size_en' => '14.5x22.3, hardcover',
                'main_image' => 'images/books/Ella.png',
                'video_url' => 'https://www.youtube.com/embed/cGmLS5KL7yw',
                'price' => '6800',
                'word_count' => '1000',
                'page_count' => '140',
                'font_size' => '24-16pt',
                'isbn' => '978-9939-884-91-2',
                'in_stock' => '0',
                'published_date' => '2023',
            ],
            [
                'title_hy' => 'Կարգապահություն առանց դրամայի',
                'title_en' => 'No-Drama Discipline',
                'category_id' => Categories::PARENT,
                'slug' => 'no-drama-discipline',
                'text_hy' => 'Այս գիրքը զայրույթի, լարվածության և ծնող-երեխա հավիտենական բախումների լուծման արդյունավետ ճանապարհային քարտեզ է։ Հեղինակները բացատրում են, թե ինչպես կարող եք հուզական կապ հաստատել ձեր երեխայի հետ, վերահսկել էմոցիաները և լարված իրավիճակները վերածել աճի ու զարգացման հնարավորության: Բացասական վարքագծի և պատժի շրջանն այսպիսով ավարտվում է:

                        Այս գիրք-ուղեցույցում կգտնեք՝

                        ռազմավարություններ, որոնք կօգնեն սահմանել ձեր և ձեր երեխայի  կարգապահության մեթոդները,

                        ուղեղի զարգացման վերաբերյալ կառուցողական խորհուրդներ՝ ամեն տարիքի և բոլոր փուլերի համար,

                        երեխայի հետ սիրալիր և հանգիստ շփվելու ուղիներ՝ անկախ ծայրահեղ վարքագծից,

                        խորհուրդներ՝ ինչպես «նավարկել փոթորկի պահին»՝ ձեր երեխայի հետ հարաբերություններ կառուցելու համար,

                        20 կարգապահական սխալ, որ թույլ են տալիս նույնիսկ ամենաբանիմաց ծնողները,

                        ինչպես կենտրոնանալ զգայական-ռացիոնալ դաստիարակության սկզբունքների և կարգապահության մեթոդների վրա։

                        Գիրքը համալրված է ծնողների անկեղծ պատմություններով և զվարճալի նկարազարդումներով։ Այն կսովորեցնի խաղաղ ճանապարհով հարթել բախումները և ամրապնդել ընտանեկան կապերը:',
                'text_en' => '',
                'description_hy' => 'Փոքրիկ մարդկանց անհաղթահարելի ու հսկայական սթրեսների, նրանց կարգապահության ու դաստիարակության գաղտնիքներին նվիրված աշխատություն',
                'description_en' => '',
                'book_size_hy' => '14.5x22.3, կոշտ կազմ',
                'book_size_en' => '14.5x22.3, hardcover',
                'main_image' => 'images/books/parent.png',
                'video_url' => 'https://www.youtube.com/embed/cGmLS5KL7yw',
                'price' => '6800',
                'word_count' => '2000',
                'page_count' => '320',
                'font_size' => '24-16pt',
                'isbn' => '978-9939-884-91-2',
                'in_stock' => '2',
                'published_date' => '2023',
            ],
            [
                'title_hy' => 'Վտվտիկի օրագիրը',
                'title_en' => 'Diary of a Wimpy Kid',
                'category_id' => Categories::GIM,
                'slug' => 'diary-of-wimpy-kid',
                'text_hy' => 'Երեխա լինելը շատ դժվար է։ Գրքի հերոս Գրեգ Հեֆլին կփաստի։
                 Միջին դպրոցում նրա ու իր մտերիմ ընկերոջ՝ Ռաուլի արկածներն անտարբեր չեն թողնի ոչ մի երեխայի։ Նրանք հայտնվում են ամենատարբեր զվարճալի, զավեշտալի ու տարօրինակ իրավիճակներում։
                    Հեղինակ և նկարազարդող Ջեֆ Քիննին «Վտվտիկի օրագիրը» գրքում ծանոթացնում է անսովոր մի հերոսի՝ Գրեգի հետ, որն իր օրագրում գրում է.
                    «Հույս չունենաք, որ այստեղ գրելու եմ իմ բոլոր «հույզերը» կամ նման մի բան։ Չէ մի չէ։ Ոչ մի «Բարև՛, սիրելի՛ օրագիր» կամ «Բարև՛, իմ օրագի՛ր»»։
                    Բարեբախտաբար մեզ համար, Գրեգ Հեֆլիի գրածն ու արածը տարբեր բաներ են։ ',
                'text_en' => '',
                'description_hy' => 'Փոքրիկ մարդկանց անհաղթահարելի ու հսկայական սթրեսների, նրանց կարգապահության ու դաստիարակության գաղտնիքներին նվիրված աշխատություն',
                'description_en' => '',
                'book_size_hy' => '18x24, կոշտ կազմ',
                'book_size_en' => '14.5x22.3, hardcover',
                'main_image' => 'images/books/Ella.png',
                'video_url' => 'https://www.youtube.com/embed/cGmLS5KL7yw',
                'price' => '5800',
                'word_count' => '1500',
                'page_count' => '222',
                'font_size' => '24-16pt',
                'isbn' => '978-9939-884-92-9',
                'in_stock' => '5',
                'published_date' => '2023',
            ],
            [
                'title_hy' => 'Կարգապահություն առանց դրամայի-test',
                'title_en' => 'No-Drama Discipline-test',
                'category_id' => Categories::DA,
                'slug' => 'no-drama-discipline-test',
                'text_hy' => 'Այս գիրքը զայրույթի, լարվածության և ծնող-երեխա հավիտենական բախումների լուծման արդյունավետ ճանապարհային քարտեզ է։ Հեղինակները բացատրում են, թե ինչպես կարող եք հուզական կապ հաստատել ձեր երեխայի հետ, վերահսկել էմոցիաները և լարված իրավիճակները վերածել աճի ու զարգացման հնարավորության: Բացասական վարքագծի և պատժի շրջանն այսպիսով ավարտվում է:

                        Այս գիրք-ուղեցույցում կգտնեք՝

                        ռազմավարություններ, որոնք կօգնեն սահմանել ձեր և ձեր երեխայի  կարգապահության մեթոդները,

                        ուղեղի զարգացման վերաբերյալ կառուցողական խորհուրդներ՝ ամեն տարիքի և բոլոր փուլերի համար,

                        երեխայի հետ սիրալիր և հանգիստ շփվելու ուղիներ՝ անկախ ծայրահեղ վարքագծից,

                        խորհուրդներ՝ ինչպես «նավարկել փոթորկի պահին»՝ ձեր երեխայի հետ հարաբերություններ կառուցելու համար,

                        20 կարգապահական սխալ, որ թույլ են տալիս նույնիսկ ամենաբանիմաց ծնողները,

                        ինչպես կենտրոնանալ զգայական-ռացիոնալ դաստիարակության սկզբունքների և կարգապահության մեթոդների վրա։

                        Գիրքը համալրված է ծնողների անկեղծ պատմություններով և զվարճալի նկարազարդումներով։ Այն կսովորեցնի խաղաղ ճանապարհով հարթել բախումները և ամրապնդել ընտանեկան կապերը:',
                'text_en' => '',
                'description_hy' => 'Փոքրիկ մարդկանց անհաղթահարելի ու հսկայական սթրեսների, նրանց կարգապահության ու դաստիարակության գաղտնիքներին նվիրված աշխատություն',
                'description_en' => '',
                'book_size_hy' => '14.5x22.3, կոշտ կազմ',
                'book_size_en' => '14.5x22.3, hardcover',
                'main_image' => 'images/books/Ella.png',
                'video_url' => 'https://www.youtube.com/embed/cGmLS5KL7yw',
                'price' => '6800',
                'word_count' => '9000',
                'page_count' => '228',
                'font_size' => '24-16pt',
                'isbn' => '978-9939-884-91-2',
                'in_stock' => '9',
                'published_date' => '2022',
            ],
            [
                'title_hy' => 'Կարգապահություն առանց դրամայի-test-2',
                'title_en' => 'No-Drama Discipline-test-2',
                'category_id' => Categories::DA,
                'slug' => 'no-drama-discipline-test-2',
                'text_hy' => 'Այս գիրքը զայրույթի, լարվածության և ծնող-երեխա հավիտենական բախումների լուծման արդյունավետ ճանապարհային քարտեզ է։ Հեղինակները բացատրում են, թե ինչպես կարող եք հուզական կապ հաստատել ձեր երեխայի հետ, վերահսկել էմոցիաները և լարված իրավիճակները վերածել աճի ու զարգացման հնարավորության: Բացասական վարքագծի և պատժի շրջանն այսպիսով ավարտվում է:

                        Այս գիրք-ուղեցույցում կգտնեք՝

                        ռազմավարություններ, որոնք կօգնեն սահմանել ձեր և ձեր երեխայի  կարգապահության մեթոդները,

                        ուղեղի զարգացման վերաբերյալ կառուցողական խորհուրդներ՝ ամեն տարիքի և բոլոր փուլերի համար,

                        երեխայի հետ սիրալիր և հանգիստ շփվելու ուղիներ՝ անկախ ծայրահեղ վարքագծից,

                        խորհուրդներ՝ ինչպես «նավարկել փոթորկի պահին»՝ ձեր երեխայի հետ հարաբերություններ կառուցելու համար,

                        20 կարգապահական սխալ, որ թույլ են տալիս նույնիսկ ամենաբանիմաց ծնողները,

                        ինչպես կենտրոնանալ զգայական-ռացիոնալ դաստիարակության սկզբունքների և կարգապահության մեթոդների վրա։

                        Գիրքը համալրված է ծնողների անկեղծ պատմություններով և զվարճալի նկարազարդումներով։ Այն կսովորեցնի խաղաղ ճանապարհով հարթել բախումները և ամրապնդել ընտանեկան կապերը:',
                'text_en' => '',
                'description_hy' => 'Փոքրիկ մարդկանց անհաղթահարելի ու հսկայական սթրեսների, նրանց կարգապահության ու դաստիարակության գաղտնիքներին նվիրված աշխատություն',
                'description_en' => '',
                'book_size_hy' => '14.5x22.3, կոշտ կազմ',
                'book_size_en' => '14.5x22.3, hardcover',
                'main_image' => 'images/books/Ella.png',
                'video_url' => 'https://www.youtube.com/embed/cGmLS5KL7yw',
                'price' => '6800',
                'word_count' => '148',
                'page_count' => '228',
                'font_size' => '24-16pt',
                'isbn' => '978-9939-884-91-2',
                'in_stock' => '100',
                'published_date' => '2023',
            ],
            [
                'title_hy' => 'Կարգապահություն առանց դրամայի-test-3',
                'title_en' => 'No-Drama Discipline-test-3',
                'category_id' => Categories::DA,
                'slug' => 'no-drama-discipline-test-3',
                'text_hy' => 'Այս գիրքը զայրույթի, լարվածության և ծնող-երեխա հավիտենական բախումների լուծման արդյունավետ ճանապարհային քարտեզ է։ Հեղինակները բացատրում են, թե ինչպես կարող եք հուզական կապ հաստատել ձեր երեխայի հետ, վերահսկել էմոցիաները և լարված իրավիճակները վերածել աճի ու զարգացման հնարավորության: Բացասական վարքագծի և պատժի շրջանն այսպիսով ավարտվում է:

                        Այս գիրք-ուղեցույցում կգտնեք՝

                        ռազմավարություններ, որոնք կօգնեն սահմանել ձեր և ձեր երեխայի  կարգապահության մեթոդները,

                        ուղեղի զարգացման վերաբերյալ կառուցողական խորհուրդներ՝ ամեն տարիքի և բոլոր փուլերի համար,

                        երեխայի հետ սիրալիր և հանգիստ շփվելու ուղիներ՝ անկախ ծայրահեղ վարքագծից,

                        խորհուրդներ՝ ինչպես «նավարկել փոթորկի պահին»՝ ձեր երեխայի հետ հարաբերություններ կառուցելու համար,

                        20 կարգապահական սխալ, որ թույլ են տալիս նույնիսկ ամենաբանիմաց ծնողները,

                        ինչպես կենտրոնանալ զգայական-ռացիոնալ դաստիարակության սկզբունքների և կարգապահության մեթոդների վրա։

                        Գիրքը համալրված է ծնողների անկեղծ պատմություններով և զվարճալի նկարազարդումներով։ Այն կսովորեցնի խաղաղ ճանապարհով հարթել բախումները և ամրապնդել ընտանեկան կապերը:',
                'text_en' => '',
                'description_hy' => 'Փոքրիկ մարդկանց անհաղթահարելի ու հսկայական սթրեսների, նրանց կարգապահության ու դաստիարակության գաղտնիքներին նվիրված աշխատություն',
                'description_en' => '',
                'book_size_hy' => '14.5x22.3, կոշտ կազմ',
                'book_size_en' => '14.5x22.3, hardcover',
                'main_image' => 'images/books/Ella.png',
                'video_url' => 'https://www.youtube.com/embed/cGmLS5KL7yw',
                'price' => '6800',
                'word_count' => '148',
                'page_count' => '228',
                'font_size' => '24-16pt',
                'isbn' => '978-9939-884-91-2',
                'in_stock' => '10',
                'published_date' => '2022',
            ],
        ];

        foreach ($books as $book) {
            Books::create($book);
        }

    }
}
