<?php

return [
    'cart' => 'Զամբյուղ',
    'in_stock' => 'Հասանելի է',
    'pcs' => 'հատ',
    'last_name' => 'Ազգանուն',
    'company_name' => 'Ընկերության անվանումը (ըստ ընտրության)',
    'first_name' => 'Անուն',
    'select_country' => 'Ընտրեք երկիրը',
    'house_and_street' => 'Փողոց',
    'apartment' => 'Բնակարան, Տուն և ալն',
    'city' => 'Քաղաք / Վարչական շրջան',
    'post_code' => 'Փոստային կոդ',
    'phone' => 'Հեռախոս',
    'email' => 'Էլեկտրոնային հասցե',
    'shipping_info' => 'Ձեր պատվերի մասին նշումներ, օրինակ, հատուկ նշումներ առաքման համար',
    'checkout_text' => 'Ձեր անձնական տվյալները կօգտագորշվեն ձեր պատվերը մշակոլու համար և այլ նպատակներով, որոնք նկարագրված են մեր <a href="https://newmag.am/terms" target="_blank">Գիրք պատվիրելու պայմանները</a> - ում։',
    'agree' => 'Կարդացել և համաձայնվում եմ օգտագործման պայմանների հետ',
    'your_order' => 'Ձեր պատվերը',
    'payment_method' => 'Վճարման եղանակ',
    'total' => 'Ընդամենը',
    'shipping' => 'Առաքում',
    'free' => 'Անվճար',
    'payable' => 'Վճարման ենթակա',
    'go_to_checkout' => 'Անցնել վճարման',
    'empty_cart' => 'Զամբյուղը դատարկ է',
    'product_is_not_in_stock' => 'Ապրանքը արդեն առկա չէ',

];

