<?php
$adminEmail = \Illuminate\Support\Facades\Cache::get("settings")["admin_email"];
return [
    'feedback' => 'Հետադարձ կապ',
    'dream' => 'Երազ',
    'dream_description' => 'մատենաշարաը բաց է գործակցության համար։ Լավագույն տարբերակը՝ էլեկտրոնային հաղորդակցությունն է։',
    'new_book_or_translate' => 'Նոր գիրք կամ թարգմանություն',
    'new_book_or_translate_text' => "Եթե հեղինակ եք կամ թարգմանիչ, եթե ունեք արդեն պատրաստի գիրք կամ թարգմանություն, ապա այդ դեպքում կարող եք նամակ ուղարկել՝ <span> $adminEmail</span> էլհասցեին: Նամակի subject բաժնում նշելով՝ «Գործակցության առաջարկ»: Նամակին կից պարդատիր է ուղարկել",
    'your_offer_book_name' => 'Ձեր առաջարկած գրքի ամբողջական անունը և կարճ նկարագրությունը:',
    'about_books' => 'Մանրամասներ գրքի մասին՝ արդեն թարգմանե՞լ եք, թե՞ նոր ցանկանում եք թարգմանել:',
    'sale' => 'Վաճառք',
    'sale_text' => "Գրքերի վաճառքի, կորպորատիվ փաթեթներ ձեռք բերելու և գրքերի մեծաքանակ պատվերների համար կարող եք նամակ ուղարկել՝ <span>$adminEmail</span>  էլհասցեին: Նամակի subject բաժնում նշելով՝ «Գործակցության առաջարկ»: Նամակին կից պարդատիր է ուղարկել",
    'work' => 'Աշխատանք',
    'work_text' => "Երազ մատենաշարաի հետ, որպես թարգմանիչ, խմբագիր, սրբագրիչ գործակցելու համար կարող եք ձեր CV-ին ուղարկել՝ <span> $adminEmail</span>  էլհասցեին: Նամակի subject բաժնում նշելով՝ «CV»:",
    'partnership' => 'Գործակցություն',
    'partnership_text' => "Համատեղ փառատոն, ծրագիր կամ մրցույթ անցկացնելու, նոր գաղափարներ քննարկելու համար կարող եք Ձեր առաջարկն ուղարկել՝<span> $adminEmail</span>  էլհասցեին:",
    'sponsorship' => 'Հովանավորություն',
    'sponsorship_text' => "Newmag հրատարակչության հետ կոմերցիոն գործակցության կամ հովանավորության առաջարկների համարկարող եք նամակ ուղարկել՝ <span> $adminEmail</span> էլհասցեին: Նամակի subject բաժնում նշելով՝ «Կոմերցիոն առաջարկ»:",
];


