<?php

return [
    'author' => 'Հեղինակ',
    'armenian_translation' => 'Հայերեն թարգմանություն',
    'group' => 'Խումբ',
    'age' => 'Տարիք',
    'word_count' => 'Բառաքանակ',
    'font_size' => 'Տառաչափ',
    'learn_more' => 'Իմանալ ավելին',
    'authors' => 'Հեղինակներ',
    'translators' => 'Թարգմանիչներ',
    'translator' => 'Թարգմանիչ',
    'see_more' => 'Տեսնել բոլորը',
    'articles' => 'Հոդվածներ',
    'buy' => 'Գնել',
    'media' => 'Մեդիա',
    'share' => 'Տարածել',
    'other_articles' => 'Այլ հոդվածներ',
    'filter' => 'Ֆիլտրել',
    'select_media' => 'Ընտրել մեդիան',
    'all' => 'Բոլորը',
    'empty_book' => 'Այս բաժնում դեռևս գրքեր չկան',
    'empty_accessors' => 'Այս բաժնում դեռևս աքսեսուարներ չկան',
    'accessors' => 'Աքսեսուարներ',
    'not_available' => 'Առկա չէ',
    'contents' => 'Բովանդակություն',
    'read_more' => 'Կարդալ ավելին',
    'additional_information' => 'Լրացուցիչ տեղեկություն',
    'original_name' => 'Օրիգինալ անուն',
    'category' => 'Կատեգորիա',
    'years' => 'Տարեկաններ',
    'published_date' => 'Հրատարակության տարին',
    'page_count' => 'էջերի քանակ',
    'size' => 'Չափս',
    'book_trailer' => 'Գրքի թրեյլեր',
    'error' => 'Սխալ',
    'payment_failed' => 'Վճարումը ձախողվեց',
    'order_success' => 'Պատվերը հաջողությամբ կատարվել է',
    'books' => 'Գրքեր',
    'search_error_result' => 'Ձեր որոնման արդյունքնեերը չեն գտնվել',
    'send_comment_message' => 'Ձեր մեկնաբանությունն ուղարկվել է, այն կտեղադրվի կայքում ադմինիստրատորի հաստատումից հետո',
    'send_comment_wrong_message' => 'Ինչ որ բան այնպես չգնաց',
    'add_comment' => 'Թողնել կարծիք',
    'full_name' => 'Անուն Ազգանուն',
    'email' => 'Էլեկտրոնային հասցե',
    'comment' => 'Կարծիք',
    'comments' => 'Կարծիքներ',
    'no_comments' => 'Կարծիքներ չկան',
    'terms' => 'Կարդացել և համաձայնվում եմ օգտագործման պայմանների հետ',
    'send' => 'Ուղարկել',
    'red_also' => 'Կարդացեք նաև',
    'email_required' => 'Էլեկտրոնային հասցեն պաւդադիր է',
    'email_type' => 'Էլեկտրոնային հասցեն վավեր չէ',
    'email_unique' => 'Էլեկտրոնային հասցեն արդեն գոյություն ունի Փորձեք այլ էլ. հասցե',
    'email_max' => 'Էլեկտրոնային հասցեն չափազանց երկար է',
    'success_subscribe' => 'Դուք հաջողությամբ բաժանորդագրվեցիք',
    'order_number' => 'Պատվերի համարը',
    'ordered_items' => 'Պատվիրված ապրանքներ',
    'orders_products' => 'Պատվիրված ապրանքներ',
    'order_receive' => 'Մենք ստացել ենք ձեր պատվերը՛',
    'hey' => 'Ողջույն',
    'we_send_order_soon' => 'Մենք այն կառաքենք ձեզ որքան հնարավոր է շուտ:',
    'total_price' => 'Ընդամենը',
    'total_price_with_discount' => 'Ընդհանուր գինը զեղչով',
    'order_created' => 'Ստեղծել է պատվերը',
    'you_can_contact' => 'Դուք կարող եք կապ հաստատել նրա հետ',
    'phone' => 'Հեռախոսահամար',
    'about_text' => '<p>Newmag հրատարակչությունը և «Սոմնիում» ընկերությունների խմբի «Երազ Փրոջեքթսը» համատեղ նախաձեռնել են
                    «Երազ» մատենաշարը։ Գործակցության շնորհիվ «Երազը» կներկայացնի հայ և արտասահմանյան մանկագիրների
                    գրքերը, և երեխաներին կհասնեն ավելի էժան գնով։ Մատենաշարը նոր մշակույթ կբերի մանկական գրականություն։
                    Յուրաքանչյուր տարիքային խմբի գիրք կունենա համապատասխան տառատեսակ, տառաչափ, դասակարգում,
                    պատկերազարդում. սա նոր մշակույթ է Հայաստանի մանկական գրահրատարակչական ոլորտում։

                <p> «Երազ» մատենաշարն ունի իր խորհրդանիշը՝ « Թռչող միաեղջյուրը», որը երեխաներին հայտնի է ճակատի
                    հատվածում մեկ եղջյուր ունեցող ձի։ Առասպելական այդ կենդանին խորհրդանշում է ողջախոհություն, հոգեկան
                    մաքրություն։</p>

                <p> «Երազ» մատենաշարի գրքերը կունենան չորս դասակարգում՝ ԱՅԲ, ԲԵՆ, ԳԻՄ, ԴԱ՝ համապատասխանաբար նախատեսված
                    0-ից 6, 6-ից 9, 10-ից 12, 12 և բարձր տարիքային խմբերի համար։ Դասակարգումները տեղ կգտնեն գրքերի վրա և
                    թույլ կտան ծնողներին ու երեխաներին հեշտությամբ ընտրել գրքերը՝ ըստ տարիքի։</p>

                <p> Հենց երեխաների գրքերի համար մշակվել է «Հեքիաթ» կոչվող հեղինակային տառատեսակը, որը հեշտ ընթեռնելի է։</p>
                <p> Գրքերից բացի մատենաշարը կներկայացնի նաև «Երազի» գրքերի հերոսներով գրենական պիտույքներ:</p>',
    'thank_you' => 'Շնորհակալություն',
    'company' => 'Ընկերություն',
    'region' => 'Տարածաշրջան',
    'street' => 'Փողոց',
    'house' => 'Շենք/Տուն',
    'postal_code' => 'Փոստային ինդեքս',
    'order_text' => 'Պատվերի նկարագրություն',
];

